package products

import (
	"errors"
	"fmt"
	"math/rand"
)

var vegetables, fruits, protein, cereal, sweets []string

func GenerateRation() []string {
	fillRation()
	availableRation := [][]string{vegetables, fruits, protein, cereal, sweets}
	readyRation := make([]string, 0, 15)

	for i, numberOfProducts := 0, 5; i < len(availableRation); i, numberOfProducts = i+1, numberOfProducts-1 {
		currentCategory := availableRation[i]
		for j := 0; j < numberOfProducts; j++ {
			readyRation = append(readyRation, getProduct(&currentCategory))
		}
	}

	return readyRation
}

func ReplaceProduct(ration *[]string, index int) error {
	if index <= 5 {
		if len(vegetables) <= 1 {
			return errors.New("not enough objects in the array")
		}
		(*ration)[index-1] = getProduct(&vegetables)
	} else if index <= 9 {
		if len(fruits) <= 1 {
			return errors.New("not enough objects in the array")
		}
		(*ration)[index-1] = getProduct(&fruits)
	} else if index <= 12 {
		if len(protein) <= 1 {
			return errors.New("not enough objects in the array")
		}
		(*ration)[index-1] = getProduct(&protein)
	} else if index <= 14 {
		if len(cereal) <= 1 {
			return errors.New("not enough objects in the array")
		}
		(*ration)[index-1] = getProduct(&cereal)
	} else {
		fmt.Println(len(sweets))
		if len(sweets) <= 1 {
			return errors.New("not enough objects in the array")
		}
		(*ration)[index-1] = getProduct(&sweets)
	}

	return nil
}

func getProduct(p *[]string) string {
	i := rand.Intn(len((*p)))
	product := (*p)[i]
	(*p) = append((*p)[:i], (*p)[i+1:]...)

	return product
}

func fillRation() {
	vegetables = []string{"огурец", "помидоры", "баклажаны", "кабачки", "тыква", "болгарский перец", "брокколи", "цветная капуста", "стручковая фасоль", "морковь", "шпинат", "репчатый лук", "красный лук", "брюссельская капуста", "зелёный горошек", "кукуруза", "спаржа", "редис", "капуста белокочанная", "капуста китайская", "картофель", "краснокачанная капуста", "свекла", "зелёный лук", "укроп", "петрушка", "розмарин", "сельдерей", "кинза", "грибы", "салат айсберг", "батат", "руколу", "цукини", "лук-порей", "редька", "репа", "патисоны", "фасоль белая", "фасоль красная", "ламинария", "щавель", "дайкон", "имбирь", "базилик", "ревень", "топинамбур", "черемша", "квашенная капуста", "морковь по-корейски", "маслины", "оливки", "хумус"}
	fruits = []string{"яблоко", "банан", "апельсин", "мандарин", "киви", "груша", "слива", "виноград зелёный", "виноград красный", "голубика", "клубника", "вишня", "малина", "персики", "нектарины", "питахайя", "фейхоа", "манго", "папайя", "арбуз", "дыня", "черешня", "помело", "финики", "куруга", "абрикос", "морошка", "ежевика", "клюква", "брусника", "жимолость", "смородина красная", "крыжовник", "смородина чёрная", "облепиха", "ананасы", "черника", "алыча", "инжир", "грейпфрут", "лимон", "гранат", "кокос", "лайм", "физалис", "маракуйя", "авокадо"}
	protein = []string{"курица", "говядина", "свинина", "кролик", "тунец", "индейка", "утка", "гусь", "творог", "сыр", "сыр охотничий", "яйца", "лосось", "сайра", "минтай", "хек", "окунь", "зубатка", "треска", "форель", "мойва", "кета", "палтус", "сибас", "пангасиус", "лакедра", "нерка", "навага", "сельдь", "горбуша", "сёмга", "креветка", "кальмар", "наггетсы такие вкусные рыбные с сыром внутри", "мидии"}
	cereal = []string{"рис белый", "рис бурый", "гречка", "булгур", "геркулес", "макароны спирали", "макароны витки", "макароны улитки", "макароны перья", "макароны ракушки", "макароны петушиные гребешки", "лапша гречневая", "фунчоза", "перловая крупа", "киноа", "чечевица"}
	sweets = []string{"белый шоколад", "молочный шоколад", "тёмный шоколад", "а вам тоже кажется, что половину названий в рыбе и овощах я выдумал?", "скитлесы", "халва", "твихс с солёной карамелью", "ириски", "конфеты коровка", "творожные палочки", "milka пузырьковая молочный пористый шоколад 72 грамма", "Алёнка со сладкой мозаикой", "шоколад тёмный вишня с перцем", "мармеладные кислые червячки", "медовик тортик", "печенье витаминизированное утреннее сэндвич с цельными злаками и йогуртной начинкой", "хлопья с единорогом и хрустящим маршмеллоу", "хлопья чуросы с корицей", "вафли глазированные с орешками", "вафли сэндвич с воздушной начинкой", "вафельные трубочки со вкусом сгущёного молока", "банка варёной сгущёнки", "вафли с халвой", "вафли сливочные", "вафли шоколадные", "пряник тульский", "пряники мятные", "вафли с варёной сгущёнкой", "вафли каприччио", "сникерс с надписью \"СУПЕР-ЕГОР\"", "пряники классические", "пряники шоколадные", "пряники имбирные", "пряники лимонные", "мини круасанны с какао", "мини круасанны со вкусом ваниль", "мини круассаны с варёной сгущёнкой", "маффины клубничные", "маффины варёная сгущёнка", "барни с бананом", "барни молочный", "шокобарни", "бисквиты Алёнка", "козинак", "вафельный торт полярный", "вафельный торт", "меренговый рулет", "бисквитный рулет", "мини-рулетики"}
}
